
import 'package:fresh_store_ui/model/Product.dart';
import 'package:fresh_store_ui/model/special_offer.dart';

import 'model/category.dart';

const String kIconPath = 'assets/icons';
const String kImagesPath = 'assets/images';
class ConstantsModel{
  static List<Category> categories = [
    Category(0, "الكل"),
    Category(1, "الارز"),
    Category(2, "السكر"),
    Category(3, "الدقيق"),
    Category(4, "البقوليات"),
    Category(5, "الزيت"),
    Category(6, "الخل"),
    Category(7, "المساحيق الجافة"),
  ];

  static List<SpecialOffer> specialOffers = [
    SpecialOffer(
        Product(
            5,
            "01-02-01-006.jpg",
            "ارز المزرعة 1ك كرتون",
            250,
            null,
            "باكت * 10",
            1
        ),
        "15% خصم",
        "قم بشراء 15 باكت و احصل علي 15% خصم"
    ),
    SpecialOffer(
        Product(
            19,
            "01-02-04-004.png",
            "فاصوليا بلدي حبوبة 500 جرام",
            360,
            null,
            "باكت * 10",
            4
        ),
        "20% خصم",
        "قم بشراء 10 باكت و احصل علي 20% خصم"
    ),
    SpecialOffer(
        Product(
            23,
            "01-02-05-001.jpg",
            "زيت سندة 550 مللي",
            750,
            null,
            "كرتونة * 12",
            5
        ),
        "3% خصم",
        "قم بشراء 6 باكت و احصل علي 3% خصم"
    ),
    SpecialOffer(
        Product(
            18,
            "01-02-04-003.png",
            "فول تدميس حبوبة 500 جرام",
            480,
            null,
            "باكت * 10",
            4
        ),
        "15% خصم",
        "قم بشراء 15 باكت و احصل علي 15% خصم"
    ),
  ];
  static List<Product> mostPopular = [
    Product(
        17,
        "01-02-04-002.png",
        "ترمس حبوبة 500 جرام",
        350,
        null,
        "باكت * 10",
        4
    ),
    Product(
        18,
        "01-02-04-003.png",
        "فول تدميس حبوبة 500 جرام",
        480,
        null,
        "باكت * 10",
        4
    ),
    Product(
        1,
        "01-02-01-001.jpg",
        "ارز احمر 1ك حبوبة",
        280,
        null,
        "باكت * 10",
        1
    ),
    Product(
        2,
        "01-02-01-003.jpg",
        "ارز سندة احمر 1ك",
        280,
        null,
        "باكت * 10",
        1
    ),
    Product(
        36,
        "01-02-07-001.jpeg",
        "خل حبوبة900ملل  مركز 5%",
        332,
        null,
        "كرتونة * 12",
        6
    ),
    Product(
        37,
        "01-02-08-002.jpg",
        "نشا 240جم حبوبة (كرتونه *12كيس)",
        332,
        null,
        "كرتونة * 12",
        7
    ),
    Product(
        14,
        "01-02-02-004.jpeg",
        "سكرسندة 950 جم",
        280,
        null,
        "باكت * 10",
        2
    ),
    Product(
        27,
        "01-02-05-015.jpg",
        "زيت حبوبة لتر",
        1200,
        null,
        "كرتونة * 12",
        5
    ),
  ];

  static List<Product> products = [
    Product(
        1,
        "01-02-01-001.jpg",
        "ارز احمر 1ك حبوبة",
        280,
        null,
        "باكت * 10",
        1
    ),
    Product(
        2,
        "01-02-01-003.jpg",
        "ارز سندة احمر 1ك",
        280,
        null,
        "باكت * 10",
        1
    ),
    Product(
        4,
        "01-02-01-005.jpg",
        "ارز حبوبة عريض 5ك",
        520,
        null,
        "باكت * 5",
        1
    ),
    Product(
        5,
        "01-02-01-006.jpg",
        "ارز المزرعة 1ك كرتون",
        250,
        null,
        "باكت * 10",
        1
    ),
    Product(
        6,
        "01-02-01-008.jpg",
        "ارز بالهنا عريض 1ك",
        251,
        null,
        "باكت * 10",
        1
    ),
    Product(
        7,
        "01-02-01-009.jpg",
        "ارز بالهنا عريض 5ك",
        490,
        null,
        "باكت * 5",
        1
    ),
    Product(
        8,
        "01-02-01-010.jpg",
        "ارز الوادى 1ك",
        260,
        null,
        "باكت * 10",
        1
    ),
    Product(
        9,
        "01-02-01-011.jpg",
        "ارز الوادى 5ك",
        580,
        null,
        "باكت * 5",
        1
    ),
    Product(
        10,
        "01-02-01-012.jpeg",
        "ارز حبوبة رفيع شيكارة 25ك",
        685,
        null,
        "شيكارة * 25",
        1
    ),
    Product(
        11,
        "01-02-01-013.jpeg",
        "ارز حبوبة عريض شيكارة 25ك",
        600,
        null,
        "شيكارة * 25",
        1
    ),
    Product(
        12,
        "01-02-02-002.jpg",
        "سكر شمس 1ك",
        350,
        null,
        "باكت * 10",
        2
    ),
    Product(
        13,
        "01-02-02-003.jpeg",
        "سكر بودرة حبوبة",
        400,
        null,
        "باكت * 10",
        2
    ),
    Product(
        14,
        "01-02-02-004.jpeg",
        "سكرسندة 950 جم",
        280,
        null,
        "باكت * 10",
        2
    ),
    Product(
        15,
        "01-02-03-001.jpg",
        "دقيق حبوبة 1ك",
        200,
        null,
        "باكت * 10",
        3
    ),
    Product(
        16,
        "01-02-04-001.png",
        "حمص حبوبة 500 جرام",
        400,
        null,
        "باكت * 10",
        4
    ),
    Product(
        17,
        "01-02-04-002.png",
        "ترمس حبوبة 500 جرام",
        350,
        null,
        "باكت * 10",
        4
    ),
    Product(
        18,
        "01-02-04-003.png",
        "فول تدميس حبوبة 500 جرام",
        480,
        null,
        "باكت * 10",
        4
    ),
    Product(
        19,
        "01-02-04-004.png",
        "فاصوليا بلدي حبوبة 500 جرام",
        360,
        null,
        "باكت * 10",
        4
    ),
    Product(
        20,
        "01-02-04-005.png",
        "ذره فشار حبوبة 500 جرام",
        210,
        null,
        "باكت * 10",
        4
    ),
    Product(
        21,
        "01-02-04-006.png",
        "عدس بجبة حبوبة 500 جرام",
        260,
        null,
        "باكت * 10",
        4
    ),
    Product(
        22,
        "01-02-04-007.png",
        "عدس اصفر حبوبة 500 جرام",
        260,
        null,
        "باكت * 10",
        4
    ),
    Product(
        23,
        "01-02-05-001.jpg",
        "زيت سندة 550 مللي",
        750,
        null,
        "كرتونة * 12",
        5
    ),
    Product(
        24,
        "01-02-05-005.jpg",
        "زيت سندة 850مللي",
        1120,
        null,
        "كرتونة * 12",
        5
    ),
    Product(
        25,
        "01-02-05-011.jpeg",
        "زيت حبوبة 770 مللي",
        860,
        null,
        "كرتونة * 12",
        5
    ),
    Product(
        26,
        "01-02-05-014.jpeg",
        "زيت حبوبة 900 مللي",
        1000,
        null,
        "كرتونة * 12",
        5
    ),
    Product(
        27,
        "01-02-05-015.jpg",
        "زيت حبوبة لتر",
        1200,
        null,
        "كرتونة * 12",
        5
    ),
    Product(
        28,
        "01-02-05-016.jpg",
        "زيت حبوبة 2400 مللي",
        1200,
        null,
        "كرتونة * 4",
        5
    ),
    Product(
        29,
        "01-02-05-017.jpeg",
        "زيت الجوهرة 2100 مللي",
        1050,
        null,
        "كرتونة * 4",
        5
    ),
    Product(
        30,
        "01-02-05-019.jpeg",
        "جركن زيت عباد 20 لتر ( 18 كيلو )",
        2500,
        null,
        "جركن",
        5
    ),
    Product(
        31,
        "01-02-05-020.jpg",
        "جركن زيت عباد 16 لتر ( 14.4 كيلو )",
        1900,
        null,
        "جركن",
        5
    ),
    Product(
        32,
        "01-02-05-021.jpg",
        "زيت الخيالة 900 مللي خليط",
        956,
        null,
        "كرتونة * 12",
        5
    ),
    Product(
        33,
        "01-02-05-022.jpg",
        "جركن زيت اولين 20 لتر ( 18 كيلو )",
        2050,
        null,
        "جركن",
        5
    ),
    Product(
        34,
        "01-02-05-023.jpg",
        "زيت الخيالة 900 مللي عباد",
        1010,
        null,
        "كرتونة * 12",
        5
    ),
    Product(
        35,
        "01-02-05-024.jpg",
        "جركن زيت صويا 20 لتر ( 18 كيلو )",
        2050,
        null,
        "جركن",
        5
    ),
    Product(
        36,
        "01-02-07-001.jpeg",
        "خل حبوبة900ملل  مركز 5%",
        332,
        null,
        "كرتونة * 12",
        6
    ),
    Product(
        37,
        "01-02-08-002.jpg",
        "نشا 240جم حبوبة (كرتونه *12كيس)",
        332,
        null,
        "كرتونة * 12",
        7
    ),
    Product(
        38,
        "01-02-08-003.jpg",
        "سحلب حبوبه 200جم (1*15كيس)",
        332,
        null,
        "باكت * 15",
        7
    ),
    Product(
        39,
        "02-02-01-001.jpg",
        "سحلب حبوبه 200جم (1*15كيس)",
        332,
        null,
        "باكت * 15",
        7
    ),
  ];
}

